Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTypes Enumeration
 The dimension types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DimensionTypes
Public Enumeration DimensionTypes
Members
Member name | Value | Description
Relative | 1 |  The point to point dimensions.
Absolute | 2 |  The dimensions from a common starting point.
RelativeAndAbsolute | 3 |  The combination of point to point and a common start point.
USAbsolute | 4 |  The dimensions from a common starting point, which includes a running dimension mark (RD).
USAbsolute2 | 16 |  The dimensions from a common starting point, which includes a running dimension mark (RD), but short dimensions are changed to point to point dimensions.
AbsoluteWithShortRelatives | 35 |  The dimensions from a common starting point, but short dimensions are changed to point to point dimensions.
AbsoluteWithAllRelativesAbove | 99 |  The combination of point to point and a common start point, but the point to point dimensions are placed above the absolute.
Elevation | 8 |  Creates an elevation dimension at a picked point.
See Also
Reference
Tekla.Structures.Drawing Namespace